---
kind: property
id: P:Autodesk.Revit.DB.Structure.ConnectionInputPoint.Id
source: html/b64eda27-dbd7-0a61-420c-7193e4dcfb84.htm
---
# Autodesk.Revit.DB.Structure.ConnectionInputPoint.Id Property

Unique id of this input point.

## Syntax (C#)
```csharp
public Guid Id { get; set; }
```